# Marging the Dataframe

In [26]:
import pandas as pd
data1= [('Jack', 34, 'Sydney', 5) ,
        ('Riti', 31, 'Delhi' , 7) ,
        ('Aadi', 46, 'New York', 11)]
df1 = pd.DataFrame(data1,columns=['Name','Age','City','Experience'],index=['a','b','c'])
print(df1)

   Name  Age      City  Experience
a  Jack   34    Sydney           5
b  Riti   31     Delhi           7
c  Aadi   46  New York          11

In [27]:
data2= [('Mohit', 34, 'Tokyo', 11) ,
        ('Veena', 31, 'London' , 10) ,
        ('Shaun', 36, 'Las Vegas', 12)]

df2 = pd.DataFrame(data2,columns=['Name','Age','City','Experience'],index=['d','e','f'])
print(df2)

    Name  Age       City  Experience
d  Mohit   34      Tokyo          11
e  Veena   31     London          10
f  Shaun   36  Las Vegas          12

In [5]:
data3= [('Mark', 47, 'Mumbai',   13) ,
        ('Jose', 43, 'Yokohama', 14) ,
        ('Ramu', 49, 'Paris',    15)]
df3 = pd.DataFrame(data3,columns=['Name','Age','City','Experience'],index=['g','h','i'])
print(df3)

   Name  Age      City  Experience
g  Mark   47    Mumbai          13
h  Jose   43  Yokohama          14
i  Ramu   49     Paris          15

In [29]:
# now combining the 3 dataframe in single one
comb_df = pd.concat([df1,df2,df3],axis=0) # Rowwise marging
print(comb_df)

      Name  Age       City  Experience  Course
a     Jack   34     Sydney         5.0     NaN
b     Riti   31      Delhi         7.0     NaN
c     Aadi   46   New York        11.0     NaN
d    Mohit   34      Tokyo        11.0     NaN
e    Veena   31     London        10.0     NaN
f    Shaun   36  Las Vegas        12.0     NaN
3  Krishna   19        NaN         NaN  Python

In [9]:
# different order
comb_df1 = pd.concat([df3,df2,df1],axis=0)
print(comb_df1)

    Name  Age       City  Experience
g   Mark   47     Mumbai          13
h   Jose   43   Yokohama          14
i   Ramu   49      Paris          15
d  Mohit   34      Tokyo          11
e  Veena   31     London          10
f  Shaun   36  Las Vegas          12
a   Jack   34     Sydney           5
b   Riti   31      Delhi           7
c   Aadi   46   New York          11

In [10]:
# By merging the columns wise --> axis=1
comb_df2 = pd.concat([df1,df2,df3],axis=1)
print(comb_df2)

   Name   Age      City  Experience   Name   Age       City  Experience  Name  \
a  Jack  34.0    Sydney         5.0    NaN   NaN        NaN         NaN   NaN
b  Riti  31.0     Delhi         7.0    NaN   NaN        NaN         NaN   NaN
c  Aadi  46.0  New York        11.0    NaN   NaN        NaN         NaN   NaN
d   NaN   NaN       NaN         NaN  Mohit  34.0      Tokyo        11.0   NaN
e   NaN   NaN       NaN         NaN  Veena  31.0     London        10.0   NaN
f   NaN   NaN       NaN         NaN  Shaun  36.0  Las Vegas        12.0   NaN
g   NaN   NaN       NaN         NaN    NaN   NaN        NaN         NaN  Mark
h   NaN   NaN       NaN         NaN    NaN   NaN        NaN         NaN  Jose
i   NaN   NaN       NaN         NaN    NaN   NaN        NaN         NaN  Ramu

    Age      City  Experience
a   NaN       NaN         NaN
b   NaN       NaN         NaN
c   NaN       NaN         NaN
d   NaN       NaN         NaN
e   NaN       NaN         NaN
f   NaN       NaN         NaN
g  47.0    Mumbai        13.0
h  43.0  Yokohama        14.0
i  49.0     Paris        15.0

In [13]:
# Another Example

dic1 = {'Name':'Ankit','Age':20,'Course':'Java'}
df1 = pd.DataFrame(dic1,index=[1])
print(df1)

    Name  Age Course
1  Ankit   20   Java

In [18]:
dic2 = {'Name':'Suhas','Age':23,'Course':'Dsa'}
df2 = pd.DataFrame(dic2,index=[2])
print(df2)

    Name  Age Course
2  Suhas   23    Dsa

In [19]:
dic3 = {'Name':'Krishna','Age':19,'Course':'Python'}
df3 = pd.DataFrame(dic3,index=[3])
print(df3)

      Name  Age  Course
3  Krishna   19  Python

In [21]:
dic4 = {'Name':'Ajay','Age':26,'Course':'sql'}
df4 = pd.DataFrame(dic4,index=[4])
print(df4)

   Name  Age Course
4  Ajay   26    sql

In [22]:
data = pd.concat([df1,df2,df3,df4],axis=0)
print(data)

      Name  Age  Course
1    Ankit   20    Java
2    Suhas   23     Dsa
3  Krishna   19  Python
4     Ajay   26     sql

In [23]:
data['Name']

1      Ankit
2      Suhas
3    Krishna
4       Ajay
Name: Name, dtype: object

In [24]:
data['Course']

1      Java
2       Dsa
3    Python
4       sql
Name: Course, dtype: object